export type TopicType = "ask" | "discuss" | "cr";
export type ForyouTopicType = {
  id: number;
  thumbnail?: string;
  title: string;
  desc: string;
  by: string;
  comments: number;
  dateTime: string;
  tags: string[];
  type: TopicType;
};

export const foryou_topics: ForyouTopicType[] = [
  {
    id: 1,
    title:
      "ขอความคิดเห็นเพื่อนๆพี่น้องๆ ด้วยครับ อายุใกล้ 60 แต่ไม่อยากหยุดทำงาน แนะนำด้วยครับ",
    desc: "เป็นพนักงาน บริษัท มาตลอดครับ ใกล้จะเกษีณแล้ว 58ใกล้60ตอนนี้ก็ต่สัญญาปีต่อปีครับ ผมคิดว่าอยากหางานทำงาน จะได้ไม่ต้องเหงา ไม้เป็นภาระลูกหลาน  แนะนำด้วยครับ เอาไงดีมีบริษัทใหนที่จะพอรับ มีความรู่ ในการบริหาร จบ ป.โท ครับ",
    by: "สมาชิกหมายเลข 1414788",
    comments: 15,
    dateTime: "2024-02-20T10:00:00Z",
    tags: ["มนุษย์เงินเดือน", "อาชีพหลังเกษียณ"],
    type: "ask",
  },
  {
    id: 2,
    title: "ถ่านชาร์จช้ามีวิธีตรวจสอบมั้ยว่าถ่านหรือเครื่องชาร์จที่เสีย",
    desc: "ถ่านไซส์ D ซื้อมาให้คนแก่ใช้ฟังวิทยุกับ ใช้มาปีนึงแล้ว จำได้ว่าเมื่อก่อนชาร์จตอน10โมง กลับบ้านมาราวๆ1ทุ่มก็เต็มแล้ว 2รอบหลังมานี่ต้องชาร์จ12ชั่วโมงถึงจะเต็ม ลองดิสชาร์จไปแล้วก็เหมือนเดิม ไม่รู้จะเช็คยังไงว่าส่วนไหนที่เป็นปัญหาจะได้ซื้อใหม่ถูกจุด",
    by: "สมาชิกหมายเลข 1092458",
    comments: 6,
    dateTime: "2024-02-20T10:00:00Z",
    tags: ["อิเล็กทรอนิกส์", "DIY Electronic", "Outdoor", "Gadget"],
    type: "ask",
  },
  {
    id: 3,
    title:
      "ในกระเป๋าถือหรือกระเป๋าสะพายที่คุณพกพาในแต่ละวัน มีสิ่งของอะไรที่จำเป็นบ้างคะ?",
    desc: "ในกระเป๋าถือหรือกระเป๋าสะพายที่คุณพกพาในแต่ละวัน  มีสิ่งของอะไรที่จำเป็นบ้างคะ ?",
    by: "เซี่ยวลี้ปวยตือ",
    comments: 27,
    dateTime: "2024-02-19T10:00:00Z",
    tags: ["Outdoor", "Gadget", "สังคมชาวพันทิป", "แฟชั่น", "มนุษย์เงินเดือน"],
    type: "discuss",
  },
  {
    id: 4,
    title:
      "เหตุผลที่คุณเลือกซื้อเครื่องปรับอากาศแต่ละยี่ห้อ คืออะไรครับ ... ???",
    desc: "เหตุผลที่คุณเลือกซื้อเครื่องปรับอากาศแต่ละยี่ห้อ คืออะไรครับ ... ??? ๑. ความทนทาน ๒. ความเย็นที่สัมผัสโดนร่างกาย ๓. ราคา ฯลฯ",
    by: "สมาชิกหมายเลข 6908898",
    comments: 25,
    dateTime: "2024-02-20T10:00:00Z",
    tags: [
      "เครื่องใช้ไฟฟ้า",
      "เครื่องปรับอากาศ",
      "Home",
      "Gadget",
      "ของใช้และอุปกรณ์เพื่อสุขภาพ",
    ],
    type: "ask",
  },
  {
    id: 5,
    thumbnail: "/id-5.jpg",
    title:
      "INDIA ที่รัก ฉันกลับมาแล้ว!! EP2. แบกเป้ตะลุยอินเดียคนเดียว ราชาสถาน Ajmer - Pushkar - Jodhpur - Bikaner",
    desc: "สวัสดีครับ ทุกๆท่าน ผมแบกเป้ตะลุยเที่ยวอินเดีย คนเดียว 3 อาทิตย์ 7 เมือง Ep. แรก ผมเดินทาง ท่องเที่ยวอินเดียเหนือ เมืองนิวเดลี มะนาลี ดารัมซาร่า การเดินทางของผมเริ่มตรงนี้ครับ https://pantip.com/topic/42522341 Ep. สอง ผมเดินทางเที่ยว รัฐราชาสถาน ดินแดนกลางทะเลทราย ไปลุยเริ่มกันเลยครับ!!",
    by: "Baypacker",
    comments: 11,
    dateTime: "2024-02-19T10:00:00Z",
    tags: [
      "บันทึกนักเดินทาง",
      "ประเทศอินเดีย",
      "เที่ยวอินเดีย",
      "เที่ยวต่างประเทศ",
      "Backpack",
    ],
    type: "discuss",
  },
  {
    id: 6,
    title:
      "ทำไมการ์ตูนอนิเมะของญี่ปุ่นไม่ทำซีรีส์อะนิเมะเเนวตำรวจสืบสวน,ตำรวจหน่วยสวาท,ตำรวจสายตรวจ,ตำรวจนักสืบเเบบหนังฝรั่งอ่ะครับ",
    desc: "",
    by: "สมาชิกหมายเลข 3288769",
    comments: 18,
    dateTime: "2024-02-20T10:00:00Z",
    tags: ["อะนิเมะ", "การ์ตูน", "ซีรีส์ฝรั่ง", "การ์ตูนญี่ปุ่น", "ภาพยนตร์"],
    type: "ask",
  },
  {
    id: 7,
    title: "ปลูกผักสวนครัวไว้กินเองช่วยประหยัดค่าใช้จ่ายในครัวเรือนไหม",
    desc: "คือสงสัยทำไมอะนิเมะญี่ปุ่นถึงไม่ทำซีรีส์เเนวตัวละครหลักเป็นตำรวจจริงๆ ไม่ใช่ตัวละครหลักเป็นนักสืบอิสระเหมือนโคนันเเบบคินดะอิจิ งงมากครับ",
    by: "สมาชิกหมายเลข 7929273",
    comments: 43,
    dateTime: "2024-02-20T10:00:00Z",
    tags: [
      "เกษตรกรรม",
      "เมนูอาหาร",
      "อาหาร",
      "ผลผลิตทางการเกษตร",
      "วัตถุดิบทำอาหาร",
    ],
    type: "ask",
  },
  {
    id: 8,
    title: "ของกินเล่น เวลาทำงานที่ทำให้ตาตื่น",
    desc: "อยากรู้ว่าเพื่อนๆมี ของกินเล่นอะไรกันบ้าง ที่กินเวลาทำงานแล้วทำให้หายง่วง นอกเหนื่อจากกาแฟนะคะส่วนตัวช่วงนี้ชอบกินสละ กับมะม่วงเปรี้ยว จิ้มพริกเกลือ ตาตื่นดีนักแล..",
    by: "สมาชิกหมายเลข 1642082",
    comments: 44,
    dateTime: "2024-02-20T10:00:00Z",
    tags: ["อาหาร", "ผลไม้", "พนักงานบริษัท", "มนุษย์เงินเดือน", "ขนม"],
    type: "discuss",
  },
  {
    id: 9,
    title: '[CR] จุดชมวิว "ห้วยคอกหมู" วิวสวย บรรยากาศดีและอากาศเย็นสบาย',
    desc: 'สวัสดีค่ะ  อยากรีวิว  จุดชมวิว   ที่ขึ้นไปแล้วประทับใจค่ะ  จริงๆแล้ว  วันอาทิตย์ที่ผ่านมา เรามีภารกิจ   งาน "คู่รักนักปั่นV7"  ซึ่งเป็นงาน ปั่นจักรยาน   ของ กลุ่ม "ปั่นให้มีความสุข"  ที่จัดกันเป็นประจำทุกปี  ปีละครั้ง ในช่วงวันวาเลนไทม์ ค่ะ ( อาจจะก่อน  หรือ หลังนิดหน่อย เพราะต้องจัดช่วงวันหยุด เสาร์- อาทิตย์) ',
    thumbnail: "/id-9.jpg",
    by: "songwarin",
    comments: 14,
    dateTime: "2024-02-20T10:00:00Z",
    tags: ["เที่ยวภูเขา", "ภาพถ่ายทิวทัศน์", "เที่ยวไทย", "อำเภอสวนผึ้ง"],
    type: "cr",
  },
];
